//
//  dataToTable.swift
//  EducationUIKit
//
//  Created by Максим Кудрявцев on 02.12.2024.
//

import Foundation

struct DataToTable {
    var nameAndSurname: String
    var image: String
    var title: String
    var date: String
    var text: String
    
    static func dataToTable() -> [DataToTable] {
        [
            DataToTable(nameAndSurname: "Kate Maffony", image: "imageTwo", title: "Что было в субботу", date: "01 декабря 2024", text: "Моя суббота была наполнена волшебной атмосферой подготовки к Новому году. Утром я достала коробки с гирляндами, игрушками и мишурой, которые весь год дожидались своего часа. Мы с семьей начали с украшения елки — каждый выбирал свои любимые игрушки, вспоминая истории, связанные с ними. После этого развесили гирлянды по всему дому, создавая мягкое и уютное свечение. В завершение добавили новогодние венки на двери и расставили свечи с ароматом корицы и еловых веток. Дом моментально наполнился теплом и ожиданием праздника, и я поняла, что эта суббота стала одним из самых ярких моментов года."),
            DataToTable(nameAndSurname: "Max YouHeart", image: "imageOne", title: "Путешествие длинною в жизнь", date: "28 ноября 2024", text: "Каждый шаг на этом пути — это новая глава, полная открытий, испытаний и вдохновения. Мы учимся, любим, ошибаемся и продолжаем идти вперед, несмотря на преграды и сомнения. Путешествие длиною в жизнь — это бесконечный поиск себя и счастья в каждом мгновении.")
        ]
    }
}
